#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_vpc.vpc: Reading...
data.aws_iam_role.labrole: Reading...
data.aws_iam_role.labrole: Read complete after 1s [id=LabRole]
data.aws_vpc.vpc: Read complete after 1s [id=vpc-0af018861a7ae534a]
data.aws_subnets.subnets: Reading...
data.aws_subnets.subnets: Read complete after 0s [id=us-east-1]
data.aws_subnet.subnet["subnet-027aeb72d45d6f585"]: Reading...
data.aws_subnet.subnet["subnet-00fc9c1bb0b5ebbfc"]: Reading...
data.aws_subnet.subnet["subnet-009a694e8e0fee0b9"]: Reading...
data.aws_subnet.subnet["subnet-01f45b6a51ff20c07"]: Reading...
data.aws_subnet.subnet["subnet-06f05788e0b3bfcf2"]: Reading...
data.aws_subnet.subnet["subnet-0a943fb7518df1599"]: Reading...
data.aws_subnet.subnet["subnet-00fc9c1bb0b5ebbfc"]: Read complete after 0s [id=subnet-00fc9c1bb0b5ebbfc]
data.aws_subnet.subnet["subnet-027aeb72d45d6f585"]: Read complete after 1s [id=subnet-027aeb72d45d6f585]
data.aws_subnet.subnet["subnet-01f45b6a51ff20c07"]: Read complete after 1s [id=subnet-01f45b6a51ff20c07]
data.aws_subnet.subnet["subnet-009a694e8e0fee0b9"]: Read complete after 1s [id=subnet-009a694e8e0fee0b9]
data.aws_subnet.subnet["subnet-06f05788e0b3bfcf2"]: Read complete after 1s [id=subnet-06f05788e0b3bfcf2]
data.aws_subnet.subnet["subnet-0a943fb7518df1599"]: Read complete after 1s [id=subnet-0a943fb7518df1599]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_access_entry.access-entry will be created
  + resource "aws_eks_access_entry" "access-entry" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "tech-challenge-lanchonete"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = [
          + "fiap",
        ]
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::590183731131:role/voclabs"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_policy_association.eks-policy will be created
  + resource "aws_eks_access_policy_association" "eks-policy" {
      + associated_at = (known after apply)
      + cluster_name  = "tech-challenge-lanchonete"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::590183731131:role/voclabs"

      + access_scope {
          + type = "cluster"
        }
    }

  # aws_eks_cluster.eks-cluster will be created
  + resource "aws_eks_cluster" "eks-cluster" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "tech-challenge-lanchonete"
      + platform_version              = (known after apply)
      + role_arn                      = "arn:aws:iam::590183731131:role/LabRole"
      + status                        = (known after apply)
      + tags_all                      = (known after apply)
      + version                       = (known after apply)

      + access_config {
          + authentication_mode = "API_AND_CONFIG_MAP"
        }

      + kubernetes_network_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-009a694e8e0fee0b9",
              + "subnet-01f45b6a51ff20c07",
              + "subnet-027aeb72d45d6f585",
              + "subnet-06f05788e0b3bfcf2",
              + "subnet-0a943fb7518df1599",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.node-group will be created
  + resource "aws_eks_node_group" "node-group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "tech-challenge-lanchonete"
      + disk_size              = 50
      + id                     = (known after apply)
      + instance_types         = [
          + "t3a.medium",
        ]
      + node_group_name        = "NG-tech-challenge-lanchonete"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::590183731131:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-009a694e8e0fee0b9",
          + "subnet-01f45b6a51ff20c07",
          + "subnet-027aeb72d45d6f585",
          + "subnet-06f05788e0b3bfcf2",
          + "subnet-0a943fb7518df1599",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_s3_bucket.backend will be created
  + resource "aws_s3_bucket" "backend" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "tcl-terraform-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_security_group.sg will be created
  + resource "aws_security_group" "sg" {
      + arn                    = (known after apply)
      + description            = "EKS Cluster Security Group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "SG-tech-challenge-lanchonete"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0af018861a7ae534a"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @vitorrafael, Action: `pull_request`*